docs/tomoko/question.org
#+STARTUP: indent nolineimages

* 質問内容

** pdfの問題
open README.pdfではadobeで開いてしまうため，
open . をして，README.texで直接いじっているけど
実際は良くないんじゃないか．
 
- 回答 :: acrobatだったらいいですよ．open README.texでtexshopが起動するんでは？
apple-iでinformation開いてこのapplicationで開くを設定すると指定したアプリで開くようになります．
この辺りは，わからんかったら聞けば答えるよ．
でも，ネットでグーぐればいくらでも出てくるので，自分でこうと思うことをやってみるのも大事．

* 中間審査
** 1
知識の習得についてもっと書く．my_help->AM/PMの話に飛ぶのは，ちょっと飛躍してる．
** 2 
何がしたいか分からない．

** 3
unixでemacsのhelpが出るけど？
別にmy_helpじゃなくてもすぐ出すことできるよね？

** 4
スキルレベル評価は誰が行うのか？私がいなくなった時どうしてしまうの？
- 評価の一般化を行う
** 5
本当にwebで表示とか実現可能なのか
** 6
wikiじゃダメなのか

* 考え
** 1
知識を他人と出し合うことによって，間違った知識の修正，知識の確立ができる．
my_helpはmanの軽い版のhelpを目的に作られたけど，目標はそこじゃない．
webで表示になると，wikiと同じようになる．
- これは，webで見れるけど，gitを使ってrepositoryにあるorgファイルを自分のパソコンにもpullして持ってこれるようにする．そうして，terminal上での参照，変更ができるようにする．

** 2
前回の説明では，自分のオリジナルのmemoと言ってしまったが，人に伝えることも意識した書き方をしていく．

** 3
これはちょっと置いとく

** 4
評価の方法．
- レベル0
コマンドなど

- レベル1
コードにおける雛形の説明

とか？？そんな感じ？

** 5
ちゃんと構想ねる．

** 6
wikiでもなあ
自分のパソコンに落とし込めれるんかな？
