docs/tomoko/question.tex
% Created 2018-09-19 水 22:44
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\author{Yamada Tomoko}
\date{\today}
\title{question}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 25.3.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents


\section{質問内容}
\label{sec-1}

\subsection{pdfの問題}
\label{sec-1-1}
open README.pdfではadobeで開いてしまうため，
open . をして，README.texで直接いじっているけど
実際は良くないんじゃないか．

\begin{description}
\item[{回答}] acrobatだったらいいですよ．open README.texでtexshopが起動するんでは？
\end{description}
apple-iでinformation開いてこのapplicationで開くを設定すると指定したアプリで開くようになります．
この辺りは，わからんかったら聞けば答えるよ．
でも，ネットでグーぐればいくらでも出てくるので，自分でこうと思うことをやってみるのも大事．

\section{中間審査}
\label{sec-2}
\subsection{1}
\label{sec-2-1}
知識の習得についてもっと書く．my$_{\text{help}}$->AM/PMの話に飛ぶのは，ちょっと飛躍してる．
\subsection{2}
\label{sec-2-2}
何がしたいか分からない．

\subsection{3}
\label{sec-2-3}
unixでemacsのhelpが出るけど？
別にmy$_{\text{helpじゃなくてもすぐ出すことできるよね？}}$

\subsection{4}
\label{sec-2-4}
スキルレベル評価は誰が行うのか？私がいなくなった時どうしてしまうの？
\begin{itemize}
\item 評価の一般化を行う
\end{itemize}
\subsection{5}
\label{sec-2-5}
本当にwebで表示とか実現可能なのか
\subsection{6}
\label{sec-2-6}
wikiじゃダメなのか

\section{考え}
\label{sec-3}
\subsection{1}
\label{sec-3-1}
知識を他人と出し合うことによって，間違った知識の修正，知識の確立ができる．
my$_{\text{helpはmanの軽い版のhelpを目的に作られたけど，目標はそこじゃない．}}$
webで表示になると，wikiと同じようになる．
\begin{itemize}
\item これは，webで見れるけど，gitを使ってrepositoryにあるorgファイルを自分のパソコンにもpullして持ってこれるようにする．そうして，terminal上での参照，変更ができるようにする．
\end{itemize}

\subsection{2}
\label{sec-3-2}
前回の説明では，自分のオリジナルのmemoと言ってしまったが，人に伝えることも意識した書き方をしていく．

\subsection{3}
\label{sec-3-3}
これはちょっと置いとく

\subsection{4}
\label{sec-3-4}
評価の方法．
\begin{itemize}
\item レベル0
\end{itemize}
コマンドなど

\begin{itemize}
\item レベル1
\end{itemize}
コードにおける雛形の説明

とか？？そんな感じ？

\subsection{5}
\label{sec-3-5}
ちゃんと構想ねる．

\subsection{6}
\label{sec-3-6}
wikiでもなあ
自分のパソコンに落とし込めれるんかな？
% Emacs 25.3.1 (Org mode 8.2.10)
\end{document}
